          // We declare prototye here and and give a name(DayNumName) to function
          // and Char(9) says this function returns 9 chatectors
          Dcl-Pr DayNumName Char(9);
           DayIn Packed(1);
          End-Pr;
 